const axios = require("axios");
const fs = require("fs");
const os = require("os");
const path = require("path");
const FormData = require("form-data");
const { cmd, commands } = require('../command');
const { runtime } = require('../lib/functions');
const config = require('../config');
const commandPrefix = config.PREFIX;


cmd({
    pattern: "menu",
    alias: ["help", "commands"],
    desc: "Show all menu categories",
    category: "menu",
    react: "⏳",
    filename: __filename
},
async (conn, mek, m, { from, pushname: _0x1279c5, reply }) => {
    try {
        const os = require("os");
        const uptime = process.uptime();
        const totalMem = os.totalmem() / (1024 ** 3);
        const freeMem = os.freemem() / (1024 ** 3);
        const usedMem = totalMem - freeMem;

        const version = "𝟐.𝟎.𝟎";
        const plugins = commands.length;
        const now = new Date();
        const time = now.toLocaleTimeString("en-US", { hour12: true, timeZone: "Asia/Karachi" });
        const date = now.toLocaleDateString("en-CA", { timeZone: "Asia/Karachi" });

        const days = Math.floor(uptime / (3600 * 24));
        const hours = Math.floor((uptime % (3600 * 24)) / 3600);
        const minutes = Math.floor((uptime % 3600) / 60);
        const seconds = Math.floor(uptime % 60);
        const uptimeStr = `${days}ᴅ ${hours}ʜ ${minutes}ᴍ ${seconds}s`;

        let menuText = `*╭┈──「${config.BOT_NAME}」┈───⊷*
*│ 🫟 ᴍᴏᴅᴇ: ${config.MODE}*
*│ 🪄 ᴘʀᴇғɪx: ${commandPrefix}*
*│ 🇦🇱 xᴅ ᴜsᴇʀ:* ${_0x1279c5 || "User"}
*│ 📍 ᴘʟᴜɢɪɴs: ${plugins}*
*│ 🎐 ᴠᴇʀsɪᴏɴ : 𝟻.𝟶︎.𝟶︎*
*│ ⏰ ᴛɪᴍᴇ ɴᴏᴡ: ${time}*
*│ 👑 ᴄʀᴇᴀᴛᴏʀ: ʟᴇɢᴇɴᴅ ᴀʟɪ*
‎*╰┈─────────────────┈⊷*
*🪀 \`GROUP-CMD\` 🪀*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴀɴᴛɪᴄ*
‎*┋* *⬡  ᴡᴇʟᴄᴏᴍᴇ*
‎*┋* *⬡  ɢᴏᴏᴅʙʏᴇ*
‎*┋* *⬡  ᴏɴʟɪɴᴇ*
‎*┋* *⬡  ᴅᴇʟᴇᴛᴇ*
‎*┋* *⬡  ɢʀᴏᴜᴘsᴛᴀᴛs*
‎*┋* *⬡  ᴀᴅᴅ*
‎*┋* *⬡  ᴘᴏʟʟ*
‎*┋* *⬡  ᴛᴀɢᴀʟʟ*
‎*┋* *⬡  ᴛᴀɢᴀᴅᴍɪɴs*
‎*┋* *⬡  ᴅᴇsᴄʀɪᴘᴛɪᴏɴ*
‎*┋* *⬡  ʟᴇғᴛ*
‎*┋* *⬡  ᴊᴏɪɴ*
‎*┋* *⬡  ɢʀᴏᴜᴘɴᴀᴍᴇ*
‎*┋* *⬡  ɢɪɴғᴏ*
‎*┋* *⬡  ɢᴇᴛɢᴘᴘ*
‎*┋* *⬡  ᴋɪᴄᴋ*
‎*┋* *⬡  ɪɴᴠɪᴛᴇ*
‎*┋* *⬡  ᴍᴜᴛᴇ*
‎*┋* *⬡  ʟᴏᴄᴋɢᴄ*
‎*┋* *⬡  ᴘʀᴏᴍᴏᴛᴇ*
‎*┋* *⬡  ᴅᴇᴍᴏᴛᴇ*
‎*┋* *⬡  ʀᴇᴠᴏᴋᴇ*
‎*┋* *⬡  ᴜɴʟᴏᴄᴋɢᴄ*
‎*┋* *⬡  ᴜɴᴍᴜᴛᴇ*
‎*┋* *⬡  ᴏᴘᴇɴᴛɪᴍᴇ*
‎*┋* *⬡  ᴄʟᴏsᴇᴛɪᴍᴇ*
‎*┋* *⬡  ʜɪᴅᴇᴛᴀɢ*
‎*┋* *⬡  ᴠᴄғ*
‎*╰──────────────────✑*
*🫟 \`EDITS-CMD\` 🫟* 
‎*╭──────────────────✑*
‎*┋* *⬡  ᴘᴀssᴇᴅ*
‎*┋* *⬡  ʙʟᴜʀ*
‎*┋* *⬡  ɪᴍɢɢᴀʏ*
‎*┋* *⬡  ɪɴᴠᴇʀᴛ*
‎*┋* *⬡  ᴊᴀɪʟ*
‎*┋* *⬡  ʀᴇᴍɪɴɪ*
‎*┋* *⬡  ʀᴍʙɢ*
‎*┋* *⬡  ᴄʜᴇᴄᴋᴘ*
‎*┋* *⬡  ᴠɪsɪᴏɴ*
‎*┋* *⬡  ᴡᴀɴᴛᴇᴅ*
‎*╰──────────────────✑*
*🧠 \`AI-CMD\` 🧠*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴀɪ*
‎*┋* *⬡  ᴏᴘᴇɴᴀɪ*
‎*┋* *⬡  ᴅᴇᴇᴘsᴇᴇᴋ*
‎*┋* *⬡  ғʟᴜxᴀɪ*
‎*┋* *⬡  sᴛᴀʙʟᴇᴅɪғғᴜsɪᴏɴ*
‎*┋* *⬡  sᴛᴀʙɪʟɪᴛʏᴀɪ*
‎*┋* *⬡  ɢᴏᴏɢʟᴇ*
‎*╰──────────────────✑*
*⚙️ \`INFO-CMD\` ⚙️* 
‎*╭──────────────────✑*
‎*┋* *⬡  ᴀʟɪᴠᴇ*
‎*┋* *⬡  ᴀʟʟᴠᴀʀ*
‎*┋* *⬡  ᴘɪɴɢ*
‎*┋* *⬡  ᴘɪɴɢ2*
‎*┋* *⬡  ʀᴜɴᴛɪᴍᴇ*
‎*┋* *⬡  ʀᴇᴘᴏ*
‎*┋* *⬡  ᴄʜᴀɴɴᴇʟ*
‎*┋* *⬡  sᴜᴘᴘᴏʀᴛ*
‎*┋* *⬡  ᴄsᴀᴠᴇ*
‎*┋* *⬡  ʙᴏᴅʏ*
‎*┋* *⬡  ᴀᴠᴀɪʟᴀʙʟᴇ*
‎*┋* *⬡  ᴄᴏᴍᴘᴏsɪɴɢ*
‎*┋* *⬡  sᴛᴀᴛᴜs*
‎*╰──────────────────✑*
*👑 \`OWNER-CMD\` 👑*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴀɴᴛɪᴅᴇʟᴇᴛᴇ*
‎*┋* *⬡  ʙʟᴏᴄᴋ*
‎*┋* *⬡  ᴜɴʙʟᴏᴄᴋ*
‎*┋* *⬡  ʙᴏᴏᴍ*
‎*┋* *⬡  ᴍᴏᴅᴇ*
‎*┋* *⬡  ᴀᴅᴍɪɴ-ᴇᴠᴇɴᴛs*
‎*┋* *⬡  ᴡᴇʟᴄᴏᴍᴇ*
‎*┋* *⬡  ᴀɴᴛɪ-ᴄᴀʟʟ*
‎*┋* *⬡  ɢᴏᴏᴅʙʏᴇ*
‎*┋* *⬡  ᴀᴜᴛᴏ-ᴛʏᴘɪɴɢ*
‎*┋* *⬡  ᴍᴇɴᴛɪᴏɴ-ʀᴇᴘʟʏ*
‎*┋* *⬡  ᴀʟᴡᴀʏs-ᴏɴʟɪɴᴇ*
‎*┋* *⬡  ᴀᴜᴛᴏ-ʀᴇᴄᴏʀᴅɪɴɢ*
‎*┋* *⬡  ᴀᴜᴛᴏ-sᴇᴇɴ*
‎*┋* *⬡  sᴛᴀᴛᴜs-ʀᴇᴀᴄᴛ*
‎*┋* *⬡  ʀᴇᴀᴅ-ᴍᴇssᴀɢᴇ*
‎*┋* *⬡  ᴀᴜᴛᴏ-ᴠᴏɪᴄᴇ*
‎*┋* *⬡  ᴀᴜᴛᴏ-sᴛɪᴄᴋᴇʀ*
‎*┋* *⬡  ᴀᴜᴛᴏ-ʀᴇᴘʟʏ*
‎*┋* *⬡  ᴀᴜᴛᴏ-ʀᴇᴀᴄᴛ*
‎*┋* *⬡  ᴏᴡɴᴇʀ-ʀᴇᴀᴄᴛ*
‎*┋* *⬡  ᴊɪᴅ*
‎*┋* *⬡  ɢᴇᴛ*
‎*┋* *⬡  ɢᴇᴛᴘᴘ*
‎*┋* *⬡  ɢᴇᴛᴘᴘ*
‎*┋* *⬡  ᴏᴜᴛ*
‎*┋* *⬡  ᴜᴘᴅᴀᴛᴇ*
‎*┋* *⬡  ᴘᴍғᴏʀᴡᴀʀᴅ*
‎*┋* *⬡  ᴠᴠ2*
‎*┋* *⬡  ʀᴇsᴛᴀʀᴛ*
‎*┋* *⬡  sᴘᴀᴍ*
‎*┋* *⬡  ᴀsᴋ*
‎*┋* *⬡  ᴀsᴋ*
‎*┋* *⬡  ᴛᴏᴠᴠ*
‎*┋* *⬡  ᴠᴠ*
‎*┋* *⬡  ᴡᴀ*
‎*╰──────────────────✑*
*🏮 \`DOWNLOAD-CMD\` 🏮*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴀᴘᴋ*
‎*┋* *⬡  ғʙᴅʟ*
‎*┋* *⬡  ɪᴍᴀɢᴇ*
‎*┋* *⬡  ɪᴍɢ2*
‎*┋* *⬡  ɪɢᴅʟ*
‎*┋* *⬡  ɪɢᴅʟ4*
‎*┋* *⬡  ɪɢ2*
‎*┋* *⬡  ɪɢ3*
‎*┋* *⬡  ʀɪɴɢᴛᴏɴᴇ*
‎*┋* *⬡  ᴛɪᴋᴛᴏᴋ*
‎*┋* *⬡  ᴛɪᴋᴛᴏᴋ2*
‎*┋* *⬡  ʏᴛᴘᴏsᴛ*
‎*┋* *⬡  ᴛᴡɪᴛᴛᴇʀ*
‎*┋* *⬡  ᴍᴇᴅɪᴀғɪʀᴇ*
‎*┋* *⬡  ɢᴅʀɪᴠᴇ*
‎*┋* *⬡  sɴᴀᴘ*
‎*┋* *⬡  ɢɪᴛᴄʟᴏɴᴇ*
‎*┋* *⬡  ᴍᴏᴠɪᴇɪɴғᴏ*
‎*┋* *⬡  ᴘɪɴᴛᴇʀᴇsᴛ*
‎*┋* *⬡  sᴘᴛᴅʟ*
‎*┋* *⬡  ᴠɪᴅᴇᴏ*
‎*┋* *⬡  ᴘʟᴀʏ*
‎*┋* *⬡  sᴏɴɢ2*
‎*╰──────────────────✑*
*🎡 \`CONVERTER-CMD\` 🎡*  
‎*╭──────────────────✑*
‎*┋* *⬡  ᴛᴏᴍᴘ3*
‎*┋* *⬡  ᴛᴏᴠᴏɪᴄᴇ*
‎*┋* *⬡  ғᴀɴᴄʏ*
‎*┋* *⬡  ᴀɴᴀʟʏᴢᴇ*
‎*┋* *⬡  ᴀᴅᴇ*
‎*┋* *⬡  ᴘʜᴏᴛᴏ*
‎*┋* *⬡  ᴛᴀᴋᴇ*
‎*┋* *⬡  sᴛɪᴄᴋᴇʀ*
‎*┋* *⬡  ᴛɪɴʏ*
‎*┋* *⬡  ᴏʙғᴜsᴄᴀᴛᴇ*
‎*┋* *⬡  ᴅᴇᴏʙғᴜsᴄᴀᴛᴇ*
‎*┋* *⬡  ᴠsᴛɪᴄᴋᴇʀ*
‎*┋* *⬡  ᴀᴛᴛᴘ*
‎*┋* *⬡  ᴛɢs*
‎*┋* *⬡  ᴜʀʟ*
‎*┋* *⬡  ᴛᴛs2*
‎*┋* *⬡  ᴛᴛs3*
‎*╰──────────────────✑*
*🪩 \`SEARCH\` 🪩*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴄᴏᴜᴘʟᴇᴘᴘ*
‎*┋* *⬡  ʟʏʀɪᴄs*
‎*┋* *⬡  ᴛɪᴍᴇᴢᴏɴᴇ*
‎*┋* *⬡  ɴᴘᴍ*
‎*┋* *⬡  ᴘᴀɪʀ*
‎*┋* *⬡  ǫʀᴄᴏᴅᴇ*
‎*┋* *⬡  ᴘʀᴀʏᴛɪᴍᴇ*
‎*┋* *⬡  ʀᴅᴀɴɪᴍᴇ*
‎*┋* *⬡  sʀᴇᴘᴏ*
‎*┋* *⬡  ʀᴡ*
‎*┋* *⬡  ʏᴛsᴛᴀʟᴋ*
‎*┋* *⬡  xsᴛᴀʟᴋ*
‎*┋* *⬡  ᴛɪᴋᴛᴏᴋsᴛᴀʟᴋ*
‎*┋* *⬡  ᴡᴀsᴛᴀʟᴋ*
‎*┋* *⬡  ɢɪᴛʜᴜʙsᴛᴀʟᴋ*
‎*┋* *⬡  ɴᴇᴡsʟᴇᴛᴛᴇʀ*
‎*┋* *⬡  ᴄᴏᴜɴᴛʀʏ*
‎*┋* *⬡  sᴄʀᴇᴇɴsʜᴏᴛ*
‎*┋* *⬡  ᴡᴇᴀᴛʜᴇʀ*
‎*┋* *⬡  ʏᴛs*
‎*╰──────────────────✑*
*🎮 \`FUN-GAMES\` 🎮*
‎*╭──────────────────✑*
‎*┋* *⬡  ᴅʀᴀɢᴏɴ*
‎*┋* *⬡  ᴇᴍɪx*
‎*┋* *⬡  ɴɪᴋᴀʟ*
‎*┋* *⬡  ᴄᴏᴍᴘᴀᴛɪʙɪʟɪᴛʏ*
‎*┋* *⬡  ᴀᴜʀᴀ*
‎*┋* *⬡  ʀᴏᴀsᴛ*
‎*┋* *⬡  8ʙᴀʟʟ*
‎*┋* *⬡  ᴄᴏᴍᴘʟɪᴍᴇɴᴛ*
‎*┋* *⬡  ʟᴏᴠᴇᴛᴇsᴛ*
‎*┋* *⬡  ᴇᴍᴏᴊɪ*
‎*┋* *⬡  ᴄʜᴀɪ*
‎*┋* *⬡  sʜᴀᴅɪ*
‎*┋* *⬡  ɪɴsᴜʟᴛ*
‎*┋* *⬡  ᴍᴇᴍᴇ*
‎*┋* *⬡  sʜɪᴘ*
‎*┋* *⬡  ʜᴀᴄᴋ*
‎*┋* *⬡  ᴅᴀɪʟʏғᴀᴄᴛ*
‎*┋* *⬡  ᴀɢᴇ*
‎*┋* *⬡  ǫᴜᴏᴛᴇ*
‎*┋* *⬡  sᴜᴘᴇʀʜᴇʀᴏ*
‎*┋* *⬡  ᴛɪᴍᴇᴛʀᴀᴠᴇʟ*
‎*┋* *⬡  ᴊᴏᴋᴇ*
‎*┋* *⬡  ғʟɪʀᴛ*
‎*┋* *⬡  ᴛʀᴜᴛʜ*
‎*┋* *⬡  ᴅᴀʀᴇ*
‎*┋* *⬡  ғᴀᴄᴛ*
‎*┋* *⬡  ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
‎*┋* *⬡  ᴄʜᴀʀᴀᴄᴛᴇʀ*
‎*┋* *⬡  ʀᴇᴘᴇᴀᴛ*
‎*┋* *⬡  ᴊᴏᴋᴇ*
‎*┋* *⬡  ғʟɪʀᴛ*
‎*┋* *⬡  ᴛʀᴜᴛʜ*
‎*┋* *⬡  ᴅᴀʀᴇ*
‎*┋* *⬡  ғᴀᴄᴛ*
‎*┋* *⬡  ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
‎*┋* *⬡  ᴄʜᴀʀᴀᴄᴛᴇʀ*
‎*┋* *⬡  ʀᴇᴘᴇᴀᴛ*
‎*┋* *⬡  ɴɢʟ*
‎*╰──────────────────✑*
*🪼 \`REACTION-CMD\` 🪼*
‎*╭──────────────────✑*
‎*┋* *⬡  ʜᴀᴘᴘʏ*
‎*┋* *⬡  ʜᴇᴀʀᴛ*
‎*┋* *⬡  ᴀɴɢʀʏ*
‎*┋* *⬡  sᴀᴅ*
‎*┋* *⬡  sʜʏ*
‎*┋* *⬡  ᴍᴏᴏɴ*
‎*┋* *⬡  ᴄᴏɴғᴜsᴇᴅ*
‎*┋* *⬡  ʜᴏᴛ*
‎*┋* *⬡  ᴄʀʏ*
‎*┋* *⬡  ᴄᴜᴅᴅʟᴇ*
‎*┋* *⬡  ʙᴜʟʟʏ*
‎*┋* *⬡  ʜᴜɢ*
‎*┋* *⬡  ᴀᴡᴏᴏ*
‎*┋* *⬡  ʟɪᴄᴋ*
‎*┋* *⬡  ᴘᴀᴛ*
‎*┋* *⬡  sᴍᴜɢ*
‎*┋* *⬡  ʙᴏɴᴋ*
‎*┋* *⬡  ʏᴇᴇᴛ*
‎*┋* *⬡  ʙʟᴜsʜ*
‎*┋* *⬡  ʜᴀɴᴅʜᴏʟᴅ*
‎*┋* *⬡  ʜɪɢʜғɪᴠᴇ*
‎*┋* *⬡  ɴᴏᴍ*
‎*┋* *⬡  ᴡᴀᴠᴇ*
‎*┋* *⬡  sᴍɪʟᴇ*
‎*┋* *⬡  ᴡɪɴᴋ*
‎*┋* *⬡  ʜᴀᴘᴘʏ*
‎*┋* *⬡  ɢʟᴏᴍᴘ*
‎*┋* *⬡  ʙɪᴛᴇ*
‎*┋* *⬡  ᴘᴏᴋᴇ*
‎*┋* *⬡  ᴄʀɪɴɢᴇ*
‎*┋* *⬡  ᴅᴀɴᴄᴇ*
‎*┋* *⬡  ᴋɪʟʟ*
‎*┋* *⬡  sʟᴀᴘ*
‎*┋* *⬡  ᴋɪss*
‎*╰──────────────────✑*
*🎗️ \`LOGOS-CMD\` 🎗️*
‎*╭──────────────────✑*
‎*┋* *⬡  3ᴅᴄᴏᴍɪᴄ*
‎*┋* *⬡  ᴅʀᴀɢᴏɴʙᴀʟʟ*
‎*┋* *⬡  ᴅᴇᴀᴅᴘᴏᴏʟ*
‎*┋* *⬡  ʙʟᴀᴄᴋᴘɪɴᴋ*
‎*┋* *⬡  ɴᴇᴏɴʟɪɢʜᴛ*
‎*┋* *⬡  ᴄᴀᴛ*
‎*┋* *⬡  sᴀᴅɢɪʀʟ*
‎*┋* *⬡  ᴘᴏʀɴʜᴜʙ*
‎*┋* *⬡  ɴᴀʀᴜᴛᴏ*
‎*┋* *⬡  ᴛʜᴏʀ*
‎*┋* *⬡  ᴀᴍᴇʀɪᴄᴀ*
‎*┋* *⬡  ᴇʀᴀsᴇʀ*
‎*┋* *⬡  3ᴅᴘᴀᴘᴇʀ*
‎*┋* *⬡  ғᴜᴛᴜʀɪsᴛɪᴄ*
‎*┋* *⬡  ᴄʟᴏᴜᴅs*
‎*┋* *⬡  sᴀɴs*
‎*┋* *⬡  ɢᴀʟᴀxʏ*
‎*┋* *⬡  ʟᴇᴀғ*
‎*┋* *⬡  sᴜɴsᴇᴛ*
‎*┋* *⬡  ɴɪɢᴇʀɪᴀ*
‎*┋* *⬡  ᴅᴇᴠɪʟᴡɪɴɢs*
‎*┋* *⬡  ʜᴀᴄᴋᴇʀ*
‎*┋* *⬡  ʙᴏᴏᴍ*
‎*┋* *⬡  ʟᴜxᴜʀʏ*
‎*┋* *⬡  ᴢᴏᴅɪᴀᴄ*
‎*┋* *⬡  ᴀɴɢᴇʟᴡɪɴɢs*
‎*┋* *⬡  ʙᴜʟʙ*
‎*┋* *⬡  ᴛᴀᴛᴏᴏ*
‎*┋* *⬡  ᴄᴀsᴛʟᴇ*
‎*┋* *⬡  ғʀᴏᴢᴇɴ*
‎*┋* *⬡  ᴘᴀɪɴᴛ*
‎*┋* *⬡  ʙɪʀᴛʜᴅᴀʏ*
‎*┋* *⬡  ᴛʏᴘᴏɢʀᴀᴘʜʏ*
‎*┋* *⬡  ʙᴇᴀʀ*
‎*┋* *⬡  ᴠᴀʟᴏʀᴀɴᴛ*
‎*╰──────────────────✑*
*🪾 \`PRIVACY-CMD\` 🪾*
‎*╭──────────────────✑*
‎*┋* *⬡  ʙʟᴏᴄᴋʟɪsᴛ*
‎*┋* *⬡  ɢᴇᴛʙɪᴏ*
‎*┋* *⬡  sᴇᴛᴘᴘᴀʟʟ*
‎*┋* *⬡  sᴇᴛᴏɴʟɪɴᴇ*
‎*┋* *⬡  sᴇᴛᴘᴘ*
‎*┋* *⬡  sᴇᴛᴍʏɴᴀᴍᴇ*
‎*┋* *⬡  ᴜᴘᴅᴀᴛᴇʙɪᴏ*
‎*┋* *⬡  ɢʀᴏᴜᴘsᴘʀɪᴠᴀᴄʏ*
‎*┋* *⬡  ɢᴇᴛᴘʀɪᴠᴀᴄʏ*
‎*╰──────────────────✑*`;

        await conn.sendMessage(from, {
            image: { url: config.ALIVE_IMG || 'https://qu.ax/zrqFX.jpg' }, 
            caption: menuText.trim(),
            contextInfo: {
                mentionedJid: [m.sender],
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363318387454868@newsletter',
                    newsletterName: config.BOT_NAME, 
                    serverMessageId: 143
        }
      }
    }, { quoted: mek });
    await conn.sendMessage(from, {
            react: { text: "✅", key: m.key }
        });

  } catch (e) {
    console.error("❌ Error in menu:", e);
    reply(`❌ Menu error: ${e.message}`);
  }
});
